# Importing Libraries

In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# Importing Dataframes

In [2]:
# Define Path
path = r'C:\Users\nickl\Instacart Basket Analysis'

In [3]:
# Import customers.csv
customers = pd.read_csv(r'C:\Users\nickl\Instacart Basket Analysis\02 Data\Original Data\customers.csv', index_col = False)

In [4]:
#Importing orders_products_merged_47.pkl
orders_products_merged_47 = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_47.pkl'))

In [5]:
# First 5 rows of customers.csv
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 4 - Wrangle Data

In [6]:
# Rename "Surnam" column to "Last Name"
customers.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [7]:
# Rename "STATE" column to "state"
customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [8]:
# Rename "date_joined" column to "Date Joined"
customers.rename(columns = {'date_joined' : 'Date Joined'}, inplace = True)

In [9]:
# Rename "n_dependants" column to "Dependants"
customers.rename(columns = {'n_dependants' : 'Dependants'}, inplace = True)

In [10]:
# Rename "fam_status" column to "Status"
customers.rename(columns = {'fam_status' : 'Status'}, inplace = True)

In [25]:
# First 5 rows of customers.csv
customers.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Dependants,Status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Step 5 - Consistency Checks

In [11]:
# Using Value Counts on customers.csv
customers.value_counts()

user_id  First Name  Last Name  Gender  State           Age  Date Joined  Dependants  Status                            income
1        Linda       Nguyen     Female  Alabama         31   2/17/2019    3           married                           40423     1
137533   Pamela      Jordan     Female  Mississippi     81   3/8/2017     0           divorced/widowed                  149021    1
137524   Joe         Dennis     Male    North Carolina  49   7/31/2018    3           married                           168826    1
137525   Jeremy      Bennett    Male    North Dakota    44   3/26/2017    1           married                           143155    1
137526   Jack        Bryan      Male    Ohio            41   12/11/2017   2           married                           41253     1
                                                                                                                                 ..
68823    Janice      Drake      Female  New Hampshire   43   12/11/2019   3           married                           127050    1
68824    Jason       Mcgee      Male    New Jersey      78   5/4/2017     0           divorced/widowed                  136277    1
68825    Anna        Allison    Female  New Mexico      52   11/12/2018   3           married                           41086     1
68826    Sean        Hinton     Male    New York        21   3/22/2017    2           living with parents and siblings  77065     1
206209   Diana       Donovan    Female  Iowa            74   9/14/2019    3           married                           137969    1
Length: 194950, dtype: int64

In [12]:
# Using the Shape function on customers.csv
customers.shape

(206209, 10)

In [13]:
# Check for missing values on customers.csv
customers.isnull().sum()

user_id            0
First Name     11259
Last Name          0
Gender             0
State              0
Age                0
Date Joined        0
Dependants         0
Status             0
income             0
dtype: int64

In [14]:
# Checking info on customers.csv
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      206209 non-null  int64
 1   First Name   194950 non-null  object
 2   Last Name    206209 non-null  object
 3   Gender       206209 non-null  object
 4   State        206209 non-null  object
 5   Age          206209 non-null  int64
 6   Date Joined  206209 non-null  object
 7   Dependants   206209 non-null  int64
 8   Status       206209 non-null  object
 9   income       206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [15]:
# Checking for mixed types on customers.csv
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

First Name

In [16]:
# Change "First Name" column data to string on customers.csv
customers['First Name'] = customers['First Name'].astype('str')

In [17]:
# Check for missing values on customer.csv
customers.isnull().sum()

user_id        0
First Name     0
Last Name      0
Gender         0
State          0
Age            0
Date Joined    0
Dependants     0
Status         0
income         0
dtype: int64

# Step 6

In [18]:
# First 5 rows on orders_products_merged_47
orders_products_merged_47.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,max_order,loyalty_flag,average_price,spending_flag,median_prior_orders,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both,10,New customer,14.0,High spender,30.0,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both,10,New customer,14.0,High spender,30.0,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both,10,New customer,14.0,High spender,30.0,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both,10,New customer,14.0,High spender,30.0,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both,10,New customer,14.0,High spender,30.0,Non-frequent customer

In [19]:
# Using the Shape function on orders_products_merged_47
orders_products_merged_47.shape

(32434212, 20)

In [20]:
# Using the info function on orders_products_merged_47
orders_products_merged_47.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434212 entries, 0 to 32434211
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_dow               int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  _merge                  category
 14  max_order               int64
 15  loyalty_flag            object
 16  average_price           float64
 17  spending_flag           object
 18  median_prior_orders     float64
 19  frequency_flag          object
dtypes: category(1), float64(4), int64(11), object(4)
memory usage: 4.9+ GB

In [21]:
# Using info function on customers.csv
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      206209 non-null  int64
 1   First Name   206209 non-null  object
 2   Last Name    206209 non-null  object
 3   Gender       206209 non-null  object
 4   State        206209 non-null  object
 5   Age          206209 non-null  int64
 6   Date Joined  206209 non-null  object
 7   Dependants   206209 non-null  int64
 8   Status       206209 non-null  object
 9   income       206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [22]:
# Using the shape function on orders_products_merged_47
orders_products_merged_47.shape

(32434212, 20)

In [23]:
# Merging the two df using the user_id column
merge = orders_products_merged_47.merge(customers, on = 'user_id')

In [24]:
# First 5 rows of merge
merge.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,First Name,Last Name,Gender,State,Age,Date Joined,Dependants,Status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [26]:
# Using the info function on merge
merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434212 entries, 0 to 32434211
Data columns (total 29 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_dow               int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   add_to_cart_order       int64
 8   reordered               int64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  _merge                  category
 14  max_order               int64
 15  loyalty_flag            object
 16  average_price           float64
 17  spending_flag           object
 18  median_prior_orders     float64
 19  frequency_flag          object
 20  First Name              object
 21  Last Name               object
 22  Gender                  object
 23  State                   object
 24  Age                     int64
 25  Date Joined             object
 26  Dependants              int64
 27  Status                  object
 28  income                  int64
dtypes: category(1), float64(4), int64(14), object(10)
memory usage: 7.0+ GB

In [27]:
# Using the Shape function on merge
merge.shape

(32434212, 29)

In [28]:
#Exoprt merge as pickle file
merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'merge.pkl'))